In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:@localhost/sakila

Read Data

In [3]:
%%sql
SELECT * FROM category;

 * mysql+pymysql://root:***@localhost/sakila
16 rows affected.

[(1, 'Action', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (2, 'Animation', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (3, 'Children', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (4, 'Classics', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (5, 'Comedy', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (6, 'Documentary', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (7, 'Drama', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (8, 'Family', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (9, 'Foreign', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (10, 'Games', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (11, 'Horror', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (12, 'Music', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (13, 'New', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (14, 'Sci-Fi', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (15, 'Sports', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (16, 'Travel', datetime.datetime(2006, 2, 15, 4, 46, 27))]

In [4]:
%%sql
SELECT * FROM customer LIMIT 10;

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[(1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', 5, 1, datetime.datetime(2006, 2, 14, 22, 4, 36), datetime.datetime(2006, 2, 15, 4, 57, 20)),
 (2, 1, 'PATRICIA', 'JOHNSON', 'PATRICIA.JOHNSON@sakilacustomer.org', 6, 1, datetime.datetime(2006, 2, 14, 22, 4, 36), datetime.datetime(2006, 2, 15, 4, 57, 20)),
 (3, 1, 'LINDA', 'WILLIAMS', 'LINDA.WILLIAMS@sakilacustomer.org', 7, 1, datetime.datetime(2006, 2, 14, 22, 4, 36), datetime.datetime(2006, 2, 15, 4, 57, 20)),
 (4, 2, 'BARBARA', 'JONES', 'BARBARA.JONES@sakilacustomer.org', 8, 1, datetime.datetime(2006, 2, 14, 22, 4, 36), datetime.datetime(2006, 2, 15, 4, 57, 20)),
 (5, 1, 'ELIZABETH', 'BROWN', 'ELIZABETH.BROWN@sakilacustomer.org', 9, 1, datetime.datetime(2006, 2, 14, 22, 4, 36), datetime.datetime(2006, 2, 15, 4, 57, 20)),
 (6, 2, 'JENNIFER', 'DAVIS', 'JENNIFER.DAVIS@sakilacustomer.org', 10, 1, datetime.datetime(2006, 2, 14, 22, 4, 36), datetime.datetime(2006, 2, 15, 4, 57, 20)),
 (7, 1, 'MARIA', 'MILLER', 'MARIA.MILLER@sakilacustomer.org', 11, 1, datetime.datetime(2006, 2, 14, 22, 4, 36), datetime.datetime(2006, 2, 15, 4, 57, 20)),
 (8, 2, 'SUSAN', 'WILSON', 'SUSAN.WILSON@sakilacustomer.org', 12, 1, datetime.datetime(2006, 2, 14, 22, 4, 36), datetime.datetime(2006, 2, 15, 4, 57, 20)),
 (9, 2, 'MARGARET', 'MOORE', 'MARGARET.MOORE@sakilacustomer.org', 13, 1, datetime.datetime(2006, 2, 14, 22, 4, 36), datetime.datetime(2006, 2, 15, 4, 57, 20)),
 (10, 1, 'DOROTHY', 'TAYLOR', 'DOROTHY.TAYLOR@sakilacustomer.org', 14, 1, datetime.datetime(2006, 2, 14, 22, 4, 36), datetime.datetime(2006, 2, 15, 4, 57, 20))]

Join table

In [5]:
%%sql
SELECT 
    f.title AS Film_Title,
    c.Name AS category
From film_category fc
JOIN category c ON c.category_id = fc.category_id
JOIN film f ON f.film_id = fc.film_id Limit 10;

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[('AMADEUS HOLY', 'Action'),
 ('AMERICAN CIRCUS', 'Action'),
 ('ANTITRUST TOMATOES', 'Action'),
 ('ARK RIDGEMONT', 'Action'),
 ('BAREFOOT MANCHURIAN', 'Action'),
 ('BERETS AGENT', 'Action'),
 ('BRIDE INTRIGUE', 'Action'),
 ('BULL SHAWSHANK', 'Action'),
 ('CADDYSHACK JEDI', 'Action'),
 ('CAMPUS REMEMBER', 'Action')]

Count the number of movie in each category

In [6]:
%%sql
SELECT 
    c.Name AS category,
    COUNT(fc.film_id) AS Total_Movies
From film_category fc
JOIN category c ON c.category_id = fc.category_id
GROUP BY fc.category_id;

 * mysql+pymysql://root:***@localhost/sakila
16 rows affected.

[('Action', 64),
 ('Animation', 66),
 ('Children', 60),
 ('Classics', 57),
 ('Comedy', 58),
 ('Documentary', 68),
 ('Drama', 62),
 ('Family', 69),
 ('Foreign', 73),
 ('Games', 61),
 ('Horror', 56),
 ('Music', 51),
 ('New', 63),
 ('Sci-Fi', 61),
 ('Sports', 74),
 ('Travel', 57)]

Sum of rental cost for Each movie category

In [7]:
%%sql
SELECT 
    c.Name AS category,
    SUM(f.rental_rate) AS Rental_Cost
From film_category fc
JOIN category c ON c.category_id = fc.category_id
JOIN film f ON f.film_id = fc.film_id
GROUP BY fc.category_id;

 * mysql+pymysql://root:***@localhost/sakila
16 rows affected.

[('Action', Decimal('169.36')),
 ('Animation', Decimal('185.34')),
 ('Children', Decimal('173.40')),
 ('Classics', Decimal('156.43')),
 ('Comedy', Decimal('183.42')),
 ('Documentary', Decimal('181.32')),
 ('Drama', Decimal('187.38')),
 ('Family', Decimal('190.31')),
 ('Foreign', Decimal('226.27')),
 ('Games', Decimal('198.39')),
 ('Horror', Decimal('169.44')),
 ('Music', Decimal('150.49')),
 ('New', Decimal('196.37')),
 ('Sci-Fi', Decimal('196.39')),
 ('Sports', Decimal('231.26')),
 ('Travel', Decimal('184.43'))]

Find Customer Who spend more then 180

In [8]:
%%sql 
SELECT customer_id, SUM(amount) AS total_spent
FROM payment
GROUP BY customer_id
HAVING total_spent > 180
ORDER BY total_spent DESC;

 * mysql+pymysql://root:***@localhost/sakila
6 rows affected.

[(526, Decimal('221.55')),
 (148, Decimal('216.54')),
 (144, Decimal('195.58')),
 (178, Decimal('194.61')),
 (137, Decimal('194.61')),
 (459, Decimal('186.62'))]

In [9]:
%%sql
SELECT c.customer_id, c.first_name, SUM(p.amount) AS total_spent
FROM payment p
JOIN customer c ON p.customer_id = c.customer_id
GROUP BY c.customer_id
HAVING total_spent > 180
ORDER BY total_spent DESC;

 * mysql+pymysql://root:***@localhost/sakila
6 rows affected.

[(526, 'KARL', Decimal('221.55')),
 (148, 'ELEANOR', Decimal('216.54')),
 (144, 'CLARA', Decimal('195.58')),
 (137, 'RHONDA', Decimal('194.61')),
 (178, 'MARION', Decimal('194.61')),
 (459, 'TOMMY', Decimal('186.62'))]

Find the total revenue, average rental duration, minimum payment and maximum payment for each category

In [10]:
%%sql
SELECT 
    c.name AS category,
    SUM(p.amount) AS total_revenue,
    AVG(f.rental_duration) AS avg_rental_duration,
    MIN(p.amount) AS min_payment,
    MAX(p.amount) AS max_payment
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
JOIN film_category fc ON f.film_id = fc.film_id
JOIN category c ON fc.category_id = c.category_id
JOIN payment p ON r.rental_id = p.rental_id
GROUP BY c.name
ORDER BY total_revenue DESC;

 * mysql+pymysql://root:***@localhost/sakila
16 rows affected.

[('Sports', Decimal('5314.21'), Decimal('4.7439'), Decimal('0.00'), Decimal('10.99')),
 ('Sci-Fi', Decimal('4756.98'), Decimal('4.7802'), Decimal('0.99'), Decimal('10.99')),
 ('Animation', Decimal('4656.30'), Decimal('4.7967'), Decimal('0.00'), Decimal('10.99')),
 ('Drama', Decimal('4587.39'), Decimal('5.0604'), Decimal('0.00'), Decimal('11.99')),
 ('Comedy', Decimal('4383.58'), Decimal('4.7991'), Decimal('0.99'), Decimal('11.99')),
 ('Action', Decimal('4375.85'), Decimal('4.9254'), Decimal('0.00'), Decimal('10.99')),
 ('New', Decimal('4351.62'), Decimal('4.5021'), Decimal('0.00'), Decimal('11.99')),
 ('Games', Decimal('4281.33'), Decimal('5.0103'), Decimal('0.00'), Decimal('10.99')),
 ('Foreign', Decimal('4270.67'), Decimal('5.1229'), Decimal('0.00'), Decimal('11.99')),
 ('Family', Decimal('4226.07'), Decimal('5.1642'), Decimal('0.00'), Decimal('11.99')),
 ('Documentary', Decimal('4217.52'), Decimal('4.6524'), Decimal('0.00'), Decimal('11.99')),
 ('Horror', Decimal('3722.54'), Decimal('4.9208'), Decimal('0.00'), Decimal('10.99')),
 ('Children', Decimal('3655.55'), Decimal('4.9958'), Decimal('0.99'), Decimal('11.99')),
 ('Classics', Decimal('3639.59'), Decimal('4.9350'), Decimal('0.99'), Decimal('10.99')),
 ('Travel', Decimal('3549.64'), Decimal('5.4695'), Decimal('0.00'), Decimal('10.99')),
 ('Music', Decimal('3417.72'), Decimal('5.2518'), Decimal('0.00'), Decimal('10.99'))]

Show first name in all lower case

In [11]:
%%sql
SELECT 
    customer_id,
    LCASE(first_name) AS Lowercase_name,
    email
FROM customer limit 10;

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[(1, 'mary', 'MARY.SMITH@sakilacustomer.org'),
 (2, 'patricia', 'PATRICIA.JOHNSON@sakilacustomer.org'),
 (3, 'linda', 'LINDA.WILLIAMS@sakilacustomer.org'),
 (4, 'barbara', 'BARBARA.JONES@sakilacustomer.org'),
 (5, 'elizabeth', 'ELIZABETH.BROWN@sakilacustomer.org'),
 (6, 'jennifer', 'JENNIFER.DAVIS@sakilacustomer.org'),
 (7, 'maria', 'MARIA.MILLER@sakilacustomer.org'),
 (8, 'susan', 'SUSAN.WILSON@sakilacustomer.org'),
 (9, 'margaret', 'MARGARET.MOORE@sakilacustomer.org'),
 (10, 'dorothy', 'DOROTHY.TAYLOR@sakilacustomer.org')]

Show Email in Upper Case

In [12]:
%%sql
SELECT 
    customer_id,
    first_name,
    UCASE(email) as EMAIL
FROM customer limit 10;

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[(1, 'MARY', 'MARY.SMITH@SAKILACUSTOMER.ORG'),
 (2, 'PATRICIA', 'PATRICIA.JOHNSON@SAKILACUSTOMER.ORG'),
 (3, 'LINDA', 'LINDA.WILLIAMS@SAKILACUSTOMER.ORG'),
 (4, 'BARBARA', 'BARBARA.JONES@SAKILACUSTOMER.ORG'),
 (5, 'ELIZABETH', 'ELIZABETH.BROWN@SAKILACUSTOMER.ORG'),
 (6, 'JENNIFER', 'JENNIFER.DAVIS@SAKILACUSTOMER.ORG'),
 (7, 'MARIA', 'MARIA.MILLER@SAKILACUSTOMER.ORG'),
 (8, 'SUSAN', 'SUSAN.WILSON@SAKILACUSTOMER.ORG'),
 (9, 'MARGARET', 'MARGARET.MOORE@SAKILACUSTOMER.ORG'),
 (10, 'DOROTHY', 'DOROTHY.TAYLOR@SAKILACUSTOMER.ORG')]

Concat first name and last name of customer

In [13]:
%%sql
SELECT 
    customer_id,
    CONCAT(first_name, ', ', last_name) AS formatted_name
FROM customer limit 10;

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[(1, 'MARY, SMITH'),
 (2, 'PATRICIA, JOHNSON'),
 (3, 'LINDA, WILLIAMS'),
 (4, 'BARBARA, JONES'),
 (5, 'ELIZABETH, BROWN'),
 (6, 'JENNIFER, DAVIS'),
 (7, 'MARIA, MILLER'),
 (8, 'SUSAN, WILSON'),
 (9, 'MARGARET, MOORE'),
 (10, 'DOROTHY, TAYLOR')]

Show username from email by substring operation

In [14]:
%%sql
SELECT 
    customer_id,
    SUBSTRING(email, 1,LOCATE('@', email) - 1) AS User_Name
FROM customer limit 10;

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[(1, 'MARY.SMITH'),
 (2, 'PATRICIA.JOHNSON'),
 (3, 'LINDA.WILLIAMS'),
 (4, 'BARBARA.JONES'),
 (5, 'ELIZABETH.BROWN'),
 (6, 'JENNIFER.DAVIS'),
 (7, 'MARIA.MILLER'),
 (8, 'SUSAN.WILSON'),
 (9, 'MARGARET.MOORE'),
 (10, 'DOROTHY.TAYLOR')]

Count of rental in month MAY

In [15]:
%%sql
SELECT 
    count(*) as Total_rental
FROM rental
WHERE MONTH(rental_date)='05';

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(1156,)]

Findout rental duration

In [16]:
%%sql
SELECT * from rental limit 10;

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[(1, datetime.datetime(2005, 5, 24, 22, 53, 30), 367, 130, datetime.datetime(2005, 5, 26, 22, 4, 30), 1, datetime.datetime(2006, 2, 15, 21, 30, 53)),
 (2, datetime.datetime(2005, 5, 24, 22, 54, 33), 1525, 459, datetime.datetime(2005, 5, 28, 19, 40, 33), 1, datetime.datetime(2006, 2, 15, 21, 30, 53)),
 (3, datetime.datetime(2005, 5, 24, 23, 3, 39), 1711, 408, datetime.datetime(2005, 6, 1, 22, 12, 39), 1, datetime.datetime(2006, 2, 15, 21, 30, 53)),
 (4, datetime.datetime(2005, 5, 24, 23, 4, 41), 2452, 333, datetime.datetime(2005, 6, 3, 1, 43, 41), 2, datetime.datetime(2006, 2, 15, 21, 30, 53)),
 (5, datetime.datetime(2005, 5, 24, 23, 5, 21), 2079, 222, datetime.datetime(2005, 6, 2, 4, 33, 21), 1, datetime.datetime(2006, 2, 15, 21, 30, 53)),
 (6, datetime.datetime(2005, 5, 24, 23, 8, 7), 2792, 549, datetime.datetime(2005, 5, 27, 1, 32, 7), 1, datetime.datetime(2006, 2, 15, 21, 30, 53)),
 (7, datetime.datetime(2005, 5, 24, 23, 11, 53), 3995, 269, datetime.datetime(2005, 5, 29, 20, 34, 53), 2, datetime.datetime(2006, 2, 15, 21, 30, 53)),
 (8, datetime.datetime(2005, 5, 24, 23, 31, 46), 2346, 239, datetime.datetime(2005, 5, 27, 23, 33, 46), 2, datetime.datetime(2006, 2, 15, 21, 30, 53)),
 (9, datetime.datetime(2005, 5, 25, 0, 0, 40), 2580, 126, datetime.datetime(2005, 5, 28, 0, 22, 40), 1, datetime.datetime(2006, 2, 15, 21, 30, 53)),
 (10, datetime.datetime(2005, 5, 25, 0, 2, 21), 1824, 399, datetime.datetime(2005, 5, 31, 22, 44, 21), 2, datetime.datetime(2006, 2, 15, 21, 30, 53))]

In [17]:
%%sql
SELECT 
    rental_id, DATEDIFF(return_date, rental_date) as Rental_Durations
FROM rental limit 10;

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[(1, 2),
 (2, 4),
 (3, 8),
 (4, 10),
 (5, 9),
 (6, 3),
 (7, 5),
 (8, 3),
 (9, 3),
 (10, 6)]

Max Rental Durations

In [18]:
%%sql
SELECT 
    rental_id, DATEDIFF(return_date, rental_date) AS MAX_Rental_Duration
FROM rental
ORDER BY MAX_Rental_Duration DESC
LIMIT 1;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(4, 10)]

In [19]:
%%sql
SELECT MAX(DATEDIFF(return_date, rental_date)) AS MAX_Rental_Duration
FROM rental;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(10,)]

Distinct Rental Year

In [20]:
%%sql
SELECT DISTINCT YEAR(rental_date) as Year
FROM rental;

 * mysql+pymysql://root:***@localhost/sakila
2 rows affected.

[(2005,), (2006,)]

Find Customers Who Have Rented More Than 40 times

In [21]:
%%sql
SELECT customer_id, first_name, last_name
FROM customer
WHERE customer_id IN (
    SELECT customer_id FROM rental
    GROUP BY customer_id
    HAVING COUNT(rental_id) > 40
);

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[(75, 'TAMMY', 'SANDERS'),
 (144, 'CLARA', 'SHAW'),
 (148, 'ELEANOR', 'HUNT'),
 (236, 'MARCIA', 'DEAN'),
 (526, 'KARL', 'SEAL')]

Films that are NOT currently in inventory

In [22]:
%%sql
SELECT film_id, title
FROM film
WHERE film_id NOT IN (
    SELECT DISTINCT film_id FROM inventory
) LIMIT 10;

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[(14, 'ALICE FANTASIA'),
 (33, 'APOLLO TEEN'),
 (36, 'ARGONAUTS TOWN'),
 (38, 'ARK RIDGEMONT'),
 (41, 'ARSENIC INDEPENDENCE'),
 (87, 'BOONDOCK BALLROOM'),
 (108, 'BUTCH PANTHER'),
 (128, 'CATCH AMISTAD'),
 (144, 'CHINATOWN GLADIATOR'),
 (148, 'CHOCOLATE DUCK')]